using System;

namespace _4._Back_in_30_Minutes
{
	class Program
	{
		static void Main(string[] args)
		{
			int hours, minutes;

			hours = int.Parse(Console.ReadLine());
			minutes = int.Parse(Console.ReadLine()) + 30;

			if (minutes > 59)
			{
				minutes -= 60;
				hours++;

				if (hours > 23)
				{
					hours -= 24;
				}
			}
			
			Console.WriteLine($"{hours}:{minutes:D2}");
		}
	}
}
//Всеки път, когато Стамат се опитва да плати сметките си, той вижда на касата табелата: „Ще се върна след 30 минути“. Един ден на Стамат му прилошало от чакане и решил, че се нуждае от програма, която отпечатва времето след 30 минути. По този начин няма да се налага да чака на бюрото и да идва в подходящото време. Той ти даде задачата, така че ти трябва да я изпълниш.
//Вход
//Входът ще бъде на два реда. На първия ред ще получите часовете, а на втория ще получите минутите.
//Изход
//Отпечатайте на конзолата времето след 30 минути. Резултатът трябва да бъде във формат hh: mm.Часовете имат едно или две числа, а минутите винаги имат две числа (с водеща нула).
//Ограничения
//• Часовете ще са между 0 и 23.
//• Минутите ще бъдат между 0 и 59.