using System;

namespace Sum_of_Odd_Numbers
{
	class Program
	{
		static void Main(string[] args)
		{
			int inputN = int.Parse(Console.ReadLine());

			int sum = 0;

			for (int i = 1; i <= inputN; i++)
			{
				sum += (i * 2) - 1;
				Console.WriteLine((i * 2) - 1);
			}

			Console.WriteLine($"Sum: {sum}");
		}
	}
}
//Напишете програма, която отпечатва следващите n нечетни числа (започвайки от 1) и на последния ред отпечатва сумата от тях.
//Вход
//На първия ред ще получите число - n. Това число показва колко нечетни числа трябва да отпечатате.
//Изход
//Отпечатайте следващите n нечетни числа, започвайки от 1, разделени с нови редове. На последния ред отпечатайте сумата от тези числа.
//Ограничения
//• n ще бъде в интервала [1 ... 100] 